src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/Номенклатура/Forms/ФормаПодбора/Module.bsl
#Область ОписаниеПеременных

// Разрядность и точность поля ввода количества: в сеансе не меняются, читаются с сервера один раз.
&НаКлиенте
Перем ФорматКоличества;

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Отбор подбора по назначению: массовый подбор в заказе на производство предлагает только готовую
// продукцию и полуфабрикаты - те же типы, что и колонка «Номенклатура» товаров (S7). Без параметра
// подбор работает как раньше, по всей номенклатуре.
//
// Параметры:
//  Отказ                - Булево - не используется.
//  СтандартнаяОбработка - Булево - не используется.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Назначение = "";
	Если Не Параметры.Свойство("НазначениеПодбора", Назначение) Или ПустаяСтрока(Назначение) Тогда
		Возврат;
	КонецЕсли;
	Типы = Новый Массив(Справочники.Номенклатура.ТипыПодбора(Назначение));
	Список.Параметры.УстановитьЗначениеПараметра("ТипыНоменклатуры", Типы);
	Список.Параметры.УстановитьЗначениеПараметра("ТипыНоменклатурыУстановлены", Истина);
	// У групп тип не заполнен: в иерархическом виде отбор спрятал бы их вместе с содержимым.
	Элементы.Список.Отображение = ОтображениеТаблицы.Список;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Или ТекДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	// Товар с характеристиками учитывается по ним: сначала выбор характеристики, потом количество.
	СЗХарактеристики = ХарактеристикиТовара(ВыбраннаяСтрока);
	Если СЗХарактеристики.Количество() = 0 Тогда
		ЗапроситьКоличество(Новый Структура("Товар", ВыбраннаяСтрока));
	Иначе
		Оп = Новый ОписаниеОповещения("ПослеВыбораХарактеристики", ЭтотОбъект, Новый Структура("Товар", ВыбраннаяСтрока));
		Заголовок = НСтр("ru = 'Выберите характеристику'; fr = 'Sélectionnez la caractéristique';
			|en = 'Select the characteristic'; es = 'Seleccione la característica'");
		СЗХарактеристики.ПоказатьВыборЭлемента(Оп, Заголовок);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораХарактеристики(ВыбранныйЭлемент, ДопПараметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДопПараметры.Вставить("Характеристика", ВыбранныйЭлемент.Значение);
	ЗапроситьКоличество(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьКоличество(ДопПараметры)
	Оп = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект, ДопПараметры);
	Подсказка = НСтр("ru = 'Введите количество'; fr = 'Saisissez la quantité';
		|en = 'Enter the quantity'; es = 'Introduzca la cantidad'");
	Если ФорматКоличества = Неопределено Тогда
		ФорматКоличества = ФорматКоличестваПодбора();
	КонецЕсли;
	ПоказатьВводЧисла(Оп, 1, Подсказка, ФорматКоличества.Разрядность, ФорматКоличества.Точность);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Или Результат <= 0 Тогда
		Возврат;
	КонецЕсли;
	Структура = Новый Структура("Номенклатура, Количество", ДопПараметры.Товар, Результат);
	Если ДопПараметры.Свойство("Характеристика") Тогда
		Структура.Вставить("Характеристика", ДопПараметры.Характеристика);
	КонецЕсли;
	ОповеститьОВыборе(Структура);
	ТекущийЭлемент = Элементы.Список;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФорматКоличестваПодбора()
	// Разрядность и точность поля ввода количества берутся у определяемого типа, в который подбор
	// это количество и положит. Литералами они здесь были потому, что на клиенте Метаданные
	// недоступны, - и разошлись с типом: стояла разрядность 15 при типе Число(12,3).
	Квалификаторы = Метаданные.ОпределяемыеТипы.КоличествоНеотрицательное.Тип.КвалификаторыЧисла;
	Результат = Новый Структура("Разрядность, Точность");
	Результат.Разрядность = Квалификаторы.Разрядность;
	Результат.Точность = Квалификаторы.РазрядностьДробнойЧасти;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ХарактеристикиТовара(Знач Товар)
	// Характеристики товара для выбора при подборе (по образцу автоподбора:
	// без помеченных на удаление и внутренних); пустой список - подбор без характеристики.
	СЗ = Новый СписокЗначений;
	Если Не Константы.ИспользоватьХарактеристикиНоменклатуры.Получить() Тогда
		Возврат СЗ;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Товар
	|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|	И НЕ ХарактеристикиНоменклатуры.ДляВнутреннегоИспользования
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХарактеристикиНоменклатуры.Наименование";
	Запрос.УстановитьПараметр("Товар", Товар);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат СЗ;
КонецФункции

#КонецОбласти
